Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
/****************************************************************************
 * arch/arm/src/stm32h7/stm32_sai_duplex.c
 *
 *   Copyright (C) 2023 Lars Thrane A/S. All rights reserved.
 *   Authors: Nikolaj Due Østerbye <ndo@thrane.eu>
 *   Copyright (C) 2013-2014, 2019 Gregory Nutt. All rights reserved.
 *   Authors: Gregory Nutt <gnutt@nuttx.org>
 *   Copyright (c) 2016 Motorola Mobility, LLC. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_STM32H7_SAI_DRIVER_DUPLEX

#include <stdint.h>
#include <assert.h>
#include <debug.h>

#include <arch/board/board.h>

#include <nuttx/irq.h>
#include <nuttx/queue.h>
#include <nuttx/wqueue.h>
#include <nuttx/mutex.h>
#include <nuttx/audio/audio.h>
#include <nuttx/audio/i2s.h>

#include "arm_internal.h"
#include "stm32_dma.h"
#include "stm32_gpio.h"
#include "stm32_sai.h"
#include "hardware/stm32_rcc.h"
#include "hardware/stm32_sai.h"

#if (defined(CONFIG_STM32H7_SAI1_A) || defined(CONFIG_STM32H7_SAI1_B))
#  error "Driver doesn't support SAI1 yet."
// TODO: handle clock and DMA
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_SCHED_WORKQUEUE
#  error Work queue support is required (CONFIG_SCHED_WORKQUEUE)
#endif

#ifndef CONFIG_AUDIO
#  error CONFIG_AUDIO required by this driver
#endif

#ifndef CONFIG_I2S
#  error CONFIG_I2S required by this driver
#endif

/* SAI1 uses standard DMA.
 * SAI4 uses BDMA.
 *
 * DMA driver will automatically translate standard DMA register values to
 * BDMA register values, if needed. So we can simply do one DMA configuration.
 */

#if (defined(CONFIG_STM32H7_SAI4_A) || defined(CONFIG_STM32H7_SAI4_B))
#  ifndef CONFIG_STM32H7_BDMA
#    error CONFIG_STM32H7_BDMA required by this driver
#  endif
#endif

#if (defined(CONFIG_STM32H7_SAI1_A) || defined(CONFIG_STM32H7_SAI1_B))
#   warning A check for DMA enablement should be done here
#endif

#if defined(CONFIG_STM32H7_SAI_DMAPRIO)
#  define SAI_DMA_PRIO       CONFIG_STM32H7_SAI_DMAPRIO
#else
#  define SAI_DMA_PRIO       DMA_SCR_PRIVERYHI
#endif

#if (SAI_DMA_PRIO & ~DMA_SCR_PL_MASK) != 0
#  error "Illegal value for CONFIG_STM32H7_SAI_DMAPRIO"
#endif

#define SAI_DMA_BASE_CR   (DMA_SCR_CIRC |DMA_SCR_MINC | SAI_DMA_PRIO | \
                           DMA_SCR_DBM | DMA_SCR_PBURST_INCR4 | \
                           DMA_SCR_MBURST_INCR4)
#define SAI_DMA_RX_CR     (DMA_SCR_PFCTRL | DMA_SCR_DIR_P2M)
#define SAI_DMA_TX_CR     (DMA_SCR_DIR_M2P)

/* SAI register can only handle 32bit writes. If PSIZE is smaller then data
 * will be duplicated.
 */
#define SAI_DMA_8BIT_CR   (DMA_SCR_PSIZE_32BITS | DMA_SCR_MSIZE_8BITS)
#define SAI_DMA_16BIT_CR  (DMA_SCR_PSIZE_32BITS | DMA_SCR_MSIZE_16BITS)
#define SAI_DMA_32BIT_CR  (DMA_SCR_PSIZE_32BITS | DMA_SCR_MSIZE_32BITS)

/* If built with CONFIG_ARMV7M_DCACHE Buffers need to be aligned and
 * multiples of ARMV7M_DCACHE_LINESIZE
 */

#define SAI_BUFFER_ADJUSTED_SIZE DCACHE_BUFFER_SIZE_ADJUST(CONFIG_STM32H7_SAI_BDMA_BUFFER_SIZE)


#define SAI_NUMBER_OF_BUFFERS CONFIG_STM32H7_SAI_USER_BUFFERS
#define SAI_NUMBER_OF_CONTAINERS SAI_NUMBER_OF_BUFFERS

/* Only one audio driver can use the SAI interface.
 * In sync mode we allow the audio driver to reserve the SAI twice. Once for
 * each audio direction.
 */

#define SAI_MAX_RESERVE 2

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Audio buffer container */

struct sai_buffer_s
{
  struct sai_buffer_s *flink; /* Supports a singly linked list */
  i2s_callback_t callback;    /* Function to call when the transfer completes */
  void *arg;                  /* The argument to return with the callback */
  struct ap_buffer_s *apb;    /* The audio buffer */
  int result;                 /* The result of the transfer */
};

/* The state of the SAI block
 *
 * If two SAI interfaces, using internal synchronization, is used for
 * full-duplex communication. One interface is always RX and the other always
 * TX.
 */

struct stm32h7_sai_s
{
  struct i2s_dev_s dev;        /* Externally visible I2S interface */

  uint8_t sai_block;           /* SAI interface number */
  uint8_t master:1;            /* Master or Slave interface */
  uint8_t tx:1;                /* This interface is TX. Otherwise RX */
  uint8_t reserved:2;          /* Only one driver may use the interface */
  uint8_t started:1;           /* Audio streaming has been started */
  uint8_t ct:1;                /* Current Target in double buffer */
  struct sai_format_s *format; /* Audio format configuration */
  uintptr_t base;              /* SAI block register base address */
  mutex_t lock;                /* Assures mutually exclusive access to SAI */
  uint8_t irq;                 /* SAI IRQ number */
  uint16_t dma_ch;             /* DMA channel number */
  DMA_HANDLE dma;              /* DMA channel handle */
  sq_queue_t pend;             /* A queue of pending transfers */
  mutex_t queue_lock;          /* Assures mutually exclusive access to queues */
  int transfer_result;         /* The result code from the last transfer */
  struct work_s work;          /* Supports worker thread operations */
  struct stm32h7_sai_s *sync_priv;  /* Pointer to synchronized SAI interface */

  /* Pre-allocated pool of buffer containers */

  sem_t bufsem;                   /* Buffer wait semaphore */
  struct sai_buffer_s *freelist;  /* A list of free buffer containers */
  struct sai_buffer_s containers[SAI_NUMBER_OF_CONTAINERS];

  /* Pre-allocated pool of audio buffers */

  sq_queue_t apb_freelist;
  struct ap_buffer_s apb_buffers[SAI_NUMBER_OF_BUFFERS];
  uint8_t apb_samps[(SAI_BUFFER_ADJUSTED_SIZE * SAI_NUMBER_OF_BUFFERS)];
  uint8_t *dma_buffer;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifdef CONFIG_DEBUG_I2S_INFO
static void     sai_dump_regs(struct stm32h7_sai_s *priv, const char *msg);
#else
#  define       sai_dump_regs(s,m)
#endif

/* Enable/disable helpers */

static void sai_disable_block(struct stm32h7_sai_s *priv);
static void sai_enable_block(struct stm32h7_sai_s *priv);
static void sai_disable(struct stm32h7_sai_s *priv);
static void sai_enable(struct stm32h7_sai_s *priv);
static void sai_disable_dma(struct stm32h7_sai_s *priv);
static void sai_enable_dma(struct stm32h7_sai_s *priv);

