Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
/* Buffer container helpers */

static struct sai_buffer_s *sai_container_allocate(struct stm32h7_sai_s *priv);
static void sai_container_free(struct stm32h7_sai_s *priv,
                         struct sai_buffer_s *bfcontainer);
static void sai_buf_initialize(struct stm32h7_sai_s *priv);

/* DMA support */

static void sai_dma_callback(DMA_HANDLE handle, uint8_t isr, void *arg);

/* I2S methods */

static int sai_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                       i2s_callback_t callback, void *arg, uint32_t timeout);
static int sai_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                    i2s_callback_t callback, void *arg, uint32_t timeout);
static int sai_ioctl(struct i2s_dev_s *dev, int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2S device operations */

static const struct i2s_ops_s g_i2sops =
{
  .i2s_receive      = sai_receive,
  .i2s_send         = sai_send,
  .i2s_ioctl        = sai_ioctl,
};

#if defined(CONFIG_STM32H7_SAI1_A)
#error TODO: place buffers in correct SRAM, dictated by DMA
static struct stm32h7_sai_s g_sai1a_priv;
uint8_t g_sai1a_dma_buffer[(SAI_BUFFER_ADJUSTED_SIZE * 2)] DCACHE_BUFFER_ALIGN locate_data(".sramX");
#endif
#if defined(CONFIG_STM32H7_SAI1_B)
#error TODO: place buffers in correct SRAM, dictated by DMA
static struct stm32h7_sai_s g_sai1b_priv;
uint8_t g_sai1b_dma_buffer[(SAI_BUFFER_ADJUSTED_SIZE * 2)] DCACHE_BUFFER_ALIGN locate_data(".sramX");
#endif
#if defined(CONFIG_STM32H7_SAI4_A)
static struct stm32h7_sai_s g_sai4a_priv;
uint8_t g_sai4a_dma_buffer[(SAI_BUFFER_ADJUSTED_SIZE * 2)] DCACHE_BUFFER_ALIGN locate_data(".sram4");
#endif
#if defined(CONFIG_STM32H7_SAI4_B)
static struct stm32h7_sai_s g_sai4b_priv;
uint8_t g_sai4b_dma_buffer[(SAI_BUFFER_ADJUSTED_SIZE * 2)] DCACHE_BUFFER_ALIGN locate_data(".sram4");
#endif

/* SAI1 state */

#ifdef CONFIG_STM32H7_SAI1_A
static struct stm32h7_sai_s g_sai1a_priv =
{
  .dev.ops        = &g_i2sops,
  .sai_block      = SAI1_BLOCK_A,
#if defined(CONFIG_STM32H7_SAI1_A_SYNC_WITH_B)
  .master         = 0,
#elif defined(CONFIG_STM32H7_SAI1_B_SYNC_WITH_A)
  .master         = 1,
#endif
  .sync_priv      = &g_sai1b_priv,
  .base           = STM32H7_SAI1_A_BASE,
  .lock           = NXMUTEX_INITIALIZER,
  .irq            = STM32_IRQ_SAI1,
  .dma_ch         = DMACHAN_SAI1_A,
  .queue_lock     = NXMUTEX_INITIALIZER,
  .reserved       = 0,
  .bufsem         = SEM_INITIALIZER(0),
  .dma_buffer     = g_sai1a_dma_buffer,
};
#endif

#ifdef CONFIG_STM32H7_SAI1_B
static struct stm32h7_sai_s g_sai1b_priv =
{
  .dev.ops        = &g_i2sops,
  .sai_block      = SAI1_BLOCK_B,
#if defined(CONFIG_STM32H7_SAI1_A_SYNC_WITH_B)
  .master         = 1,
#elif defined(CONFIG_STM32H7_SAI1_B_SYNC_WITH_A)
  .master         = 0,
#endif
  .sync_priv      = &g_sai1a_priv,
  .base           = STM32H7_SAI1_B_BASE,
  .lock           = NXMUTEX_INITIALIZER,
  .irq            = STM32_IRQ_SAI1,
  .dma_ch         = DMACHAN_SAI1_B,
  .queue_lock     = NXMUTEX_INITIALIZER,
  .reserved       = 0,
  .bufsem         = SEM_INITIALIZER(0),
  .dma_buffer     = g_sai1b_dma_buffer,
};
#endif

/* SAI4 state */

#ifdef CONFIG_STM32H7_SAI4_A
static struct stm32h7_sai_s g_sai4a_priv =
{
  .dev.ops        = &g_i2sops,
  .sai_block      = SAI4_BLOCK_A,
#if defined(CONFIG_STM32H7_SAI4_A_SYNC_WITH_B)
  .master         = 0,
#elif defined(CONFIG_STM32H7_SAI4_B_SYNC_WITH_A)
  .master         = 1,
#endif
  .sync_priv      = &g_sai4b_priv,
  .base           = STM32H7_SAI4_A_BASE,
  .lock           = NXMUTEX_INITIALIZER,
  .irq            = STM32_IRQ_SAI4,
  .dma_ch         = DMAMAP_BDMA_SAI4A,
  .queue_lock     = NXMUTEX_INITIALIZER,
  .reserved       = 0,
  .bufsem         = SEM_INITIALIZER(0),
  .dma_buffer     = g_sai4a_dma_buffer,
};
#endif

#ifdef CONFIG_STM32H7_SAI4_B
static struct stm32h7_sai_s g_sai4b_priv =
{
  .dev.ops        = &g_i2sops,
  .sai_block      = SAI4_BLOCK_B,
#if defined(CONFIG_STM32H7_SAI4_A_SYNC_WITH_B)
  .master         = 1,
#elif defined(CONFIG_STM32H7_SAI4_B_SYNC_WITH_A)
  .master         = 0,
#endif
  .sync_priv      = &g_sai4a_priv,
  .base           = STM32H7_SAI4_B_BASE,
  .lock           = NXMUTEX_INITIALIZER,
  .irq            = STM32_IRQ_SAI4,
  .dma_ch         = DMAMAP_BDMA_SAI4B,
  .queue_lock     = NXMUTEX_INITIALIZER,
  .reserved       = 0,
  .bufsem         = SEM_INITIALIZER(0),
  .dma_buffer     = g_sai4b_dma_buffer,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sai_getreg
 *
 * Description:
 *   Get the contents of the SAI register at offset
 *
 * Input Parameters:
 *   priv   - private SAI device structure
 *   offset - offset to the register of interest
 *
 * Returned Value:
 *   The contents of the 32-bit register
 *
 ****************************************************************************/

static inline uint32_t sai_getreg(struct stm32h7_sai_s *priv, uint8_t offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: sai_putreg
 *
 * Description:
 *   Write a 32-bit value to the SAI register at offset
 *
 * Input Parameters:
 *   priv   - private SAI device structure
 *   offset - offset to the register of interest
 *   value  - the 32-bit value to be written
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void sai_putreg(struct stm32h7_sai_s *priv, uint8_t offset,
                              uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: sai_modifyreg
 *
 * Description:
 *   Clear and set bits in the SAI register at offset
 *
 * Input Parameters:
 *   priv    - private SAI device structure
 *   offset  - offset to the register of interest
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_modifyreg(struct stm32h7_sai_s *priv, uint8_t offset,
                          uint32_t clrbits, uint32_t setbits)
{
  uint32_t regval;

