Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
  regval  = sai_getreg(priv, offset);
  regval &= ~clrbits;
  regval |= setbits;
  sai_putreg(priv, offset, regval);
}

/****************************************************************************
 * Name: sai_dump_regs
 *
 * Description:
 *   Dump the contents of all SAI block registers
 *
 * Input Parameters:
 *   priv - The SAI block controller to dump
 *   msg - Message to print before the register data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_I2S_INFO
static void sai_dump_regs(struct stm32h7_sai_s *priv, const char *msg)
{
  if (msg)
      i2sinfo("%s\n", msg);

#if defined(CONFIG_STM32H7_SAI1_A) || defined(CONFIG_STM32H7_SAI1_B)
  uint32_t gcr = getreg32(STM32H7_SAI1_GCR);
  i2sinfo("GCR: *%08x = %08x\n", STM32H7_SAI1_GCR, gcr);
#endif
#if defined(CONFIG_STM32H7_SAI4_A) || defined(CONFIG_STM32H7_SAI4_B)
  uint32_t gcr = getreg32(STM32H7_SAI4_GCR);
  i2sinfo("GCR: *%08x = %08x\n", STM32H7_SAI4_GCR, gcr);
#endif
  i2sinfo("CR1:%08x CR2:%08x  FRCR:%08x SLOTR:%08x\n",
          sai_getreg(priv, STM32H7_SAI_CR1_OFFSET),
          sai_getreg(priv, STM32H7_SAI_CR2_OFFSET),
          sai_getreg(priv, STM32H7_SAI_FRCR_OFFSET),
          sai_getreg(priv, STM32H7_SAI_SLOTR_OFFSET));
  i2sinfo(" IM:%08x  SR:%08x CLRFR:%08x\n",
          sai_getreg(priv, STM32H7_SAI_IM_OFFSET),
          sai_getreg(priv, STM32H7_SAI_SR_OFFSET),
          sai_getreg(priv, STM32H7_SAI_CLRFR_OFFSET));
}
#endif

/****************************************************************************
 * Name: sai_pwr_disable
 *
 * Description:
 *   Turn off clock for SAI interface and (B)DMA.
 *   Will power off both blocks belonging to an interface, since they share
 *   clock and DMA.
 *
 * Input Parameters:
 *   intf - The SAI block that should be powered down
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_pwr_disable(int intf)
{
  uint32_t regval;

  i2sinfo("Entry");

#if defined(CONFIG_STM32H7_SAI4_A) || defined(CONFIG_STM32H7_SAI4_B)
  if (intf == SAI4_BLOCK_A || intf == SAI4_BLOCK_B)
    {
      regval = getreg32(STM32_RCC_APB4ENR);
      regval &= ~RCC_APB4ENR_SAI4EN;
      putreg32(regval, STM32_RCC_APB4ENR);

      regval = getreg32(STM32_RCC_AHB4ENR);
      regval &= ~RCC_AHB4ENR_BDMAEN;
      putreg32(regval, STM32_RCC_AHB4ENR);
    }
#endif

#if defined(CONFIG_STM32H7_SAI1_A) || defined(CONFIG_STM32H7_SAI1_B)
#    error "TODO: Clock and DMA disable for SAI1 missing"
#endif
}

/****************************************************************************
 * Name: sai_pwr_enable
 *
 * Description:
 *   Turn on clock for SAI interface and (B)DMA.
 *   Will power on both blocks belonging to an interface, since they share
 *   clock and DMA.
 *
 * Input Parameters:
 *   intf - The SAI block that should be powered up
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_pwr_enable(int intf)
{
  uint32_t regval;

  i2sinfo("Entry");

#if defined(CONFIG_STM32H7_SAI4_A) || defined(CONFIG_STM32H7_SAI4_B)
  if (intf == SAI4_BLOCK_A || intf == SAI4_BLOCK_B)
    {
      regval = getreg32(STM32_RCC_APB4ENR);
      regval |= RCC_APB4ENR_SAI4EN;
      putreg32(regval, STM32_RCC_APB4ENR);

      regval = getreg32(STM32_RCC_AHB4ENR);
      regval |= RCC_AHB4ENR_BDMAEN;
      putreg32(regval, STM32_RCC_AHB4ENR);
    }
#endif

#if defined(CONFIG_STM32H7_SAI1_A) || defined(CONFIG_STM32H7_SAI1_B)
#   error "TODO: Clock and DMA enable for SAI1 missing"
#endif
}

/****************************************************************************
 * Name: sai_disable_block
 *
 * Description:
 *   Put single SAI block in disabled mode.
 *   After enable bit has been cleared SAI will continue to finish any RX/TX
 *   operations. When done, SAI will clear the enable bit in the register.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_disable_block(struct stm32h7_sai_s *priv)
{
  uint32_t regcr1;

  DEBUGASSERT(priv);

  regcr1 = sai_getreg(priv, STM32H7_SAI_CR1_OFFSET);

  if ((regcr1 & SAI_CR1_SAIEN) != 0)
    {
      regcr1 &= ~SAI_CR1_SAIEN;
      sai_putreg(priv, STM32H7_SAI_CR1_OFFSET, regcr1);

      do
        {
          /* SAI will be disabled when finished with current RX/TX. */

          usleep(10);
          regcr1 = sai_getreg(priv, STM32H7_SAI_CR1_OFFSET);
        } while (regcr1 & SAI_CR1_SAIEN);
    }
}

/****************************************************************************
 * Name: sai_enable_block
 *
 * Description:
 *   Enable single SAI block.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_enable_block(struct stm32h7_sai_s *priv)
{
  uint32_t regcr1;

  DEBUGASSERT(priv);

  regcr1 = sai_getreg(priv, STM32H7_SAI_CR1_OFFSET);

  if ((regcr1 & SAI_CR1_SAIEN) == 0)
    {
      regcr1 |= SAI_CR1_SAIEN;
      sai_putreg(priv, STM32H7_SAI_CR1_OFFSET, regcr1);
    }
}

/****************************************************************************
 * Name: sai_disable
 *
 * Description:
 *   Disable both blocks belonging to the same SAI interface. In synchronous
 *   mode Master and Slave must be en-/dis-abled in specific order.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_disable(struct stm32h7_sai_s *priv)
{
  struct stm32h7_sai_s *priv_master;
  struct stm32h7_sai_s *priv_slave;

  i2sinfo("Entry");

  DEBUGASSERT(priv && priv->sync_priv);

  priv_master = (priv->master) ? priv : priv->sync_priv;
  priv_slave = (priv->master) ? priv->sync_priv : priv;

  sai_disable_block(priv_master);
  sai_disable_block(priv_slave);
}

/****************************************************************************
 * Name: sai_enable
 *
 * Description:
 *   Enable both blocks belonging to the same SAI interface. In synchronous
 *   mode Master and Slave must be en-/dis-abled in specific order.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_enable(struct stm32h7_sai_s *priv)
{
  struct stm32h7_sai_s *priv_master;
  struct stm32h7_sai_s *priv_slave;

  i2sinfo("Entry");

  DEBUGASSERT(priv && priv->sync_priv);

  priv_master = (priv->master) ? priv : priv->sync_priv;
  priv_slave = (priv->master) ? priv->sync_priv : priv;

