Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
  sai_enable_block(priv_slave);
  sai_enable_block(priv_master);
}

/****************************************************************************
 * Name: sai_disable_dma
 *
 * Description:
 *   Disable DMA for both blocks belonging to the same SAI interface.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_disable_dma(struct stm32h7_sai_s *priv)
{
  DEBUGASSERT(priv && priv->sync_priv);

  sai_modifyreg(priv, STM32H7_SAI_CR1_OFFSET, SAI_CR1_DMAEN, 0);
  sai_modifyreg(priv->sync_priv, STM32H7_SAI_CR1_OFFSET, SAI_CR1_DMAEN, 0);

  sai_modifyreg(priv, STM32H7_SAI_CR2_OFFSET, 0, SAI_CR2_FFLUSH);
  sai_modifyreg(priv->sync_priv, STM32H7_SAI_CR2_OFFSET, 0, SAI_CR2_FFLUSH);

  sai_modifyreg(priv, STM32H7_SAI_CLRFR_OFFSET, 0, 0xFFFFFFFF);
  sai_modifyreg(priv->sync_priv, STM32H7_SAI_CLRFR_OFFSET, 0, 0xFFFFFFFF);
}

/****************************************************************************
 * Name: sai_enable_dma
 *
 * Description:
 *   Enable DMA for both blocks belonging to the same SAI interface.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_enable_dma(struct stm32h7_sai_s *priv)
{
  struct stm32h7_sai_s *priv_tx;
  uint32_t fifolvl;

  DEBUGASSERT(priv && priv->sync_priv);

  priv_tx = (priv->tx) ? priv : priv->sync_priv;

  sai_modifyreg(priv, STM32H7_SAI_CR1_OFFSET, 0, SAI_CR1_DMAEN);
  sai_modifyreg(priv->sync_priv, STM32H7_SAI_CR1_OFFSET, 0, SAI_CR1_DMAEN);

  do
    {
      /* Wait for TX FIFO to have content. */

      fifolvl = sai_getreg(priv_tx, STM32H7_SAI_SR_OFFSET) & SAI_INT_FLVL_MASK;
    } while (fifolvl == SAI_INT_FLVL_EMPTY);
}

/****************************************************************************
 * Name: sai_clear_queue
 *
 * Description:
 *   Clear single queue of SAI buffer containers.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *   q - buffer container queue to be cleared
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_clear_queue(struct stm32h7_sai_s *priv, sq_queue_t *q)
{
  struct sai_buffer_s *bfcontainer;

  while (!sq_empty(q))
    {
      bfcontainer = (struct sai_buffer_s *)sq_remfirst(q);
      sai_container_free(priv, bfcontainer);
    }
}

/****************************************************************************
 * Name: sai_clear_all_queues
 *
 * Description:
 *   Clear all queues of SAI buffer containers.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_clear_all_queues(struct stm32h7_sai_s *priv)
{
  nxmutex_lock(&priv->queue_lock);
  sai_clear_queue(priv, &priv->pend);
  nxmutex_unlock(&priv->queue_lock);
  nxmutex_lock(&priv->sync_priv->queue_lock);
  sai_clear_queue(priv->sync_priv, &priv->sync_priv->pend);
  nxmutex_unlock(&priv->sync_priv->queue_lock);
}

/****************************************************************************
 * Name: sai_fill_buffer_rx
 *
 * Description:
 *   Copy data from DMA input buffer to user space audio buffer and return the
 *   audio buffer to user space.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void sai_fill_buffer_rx(struct stm32h7_sai_s *priv)
{
  struct sai_buffer_s *bfcontainer;

  nxmutex_lock(&priv->queue_lock);
  bfcontainer = (struct sai_buffer_s *)sq_remfirst(&priv->pend);
  nxmutex_unlock(&priv->queue_lock);

  /* If we don't have a buffer from userspace then we just forget about the
   * data we just received.
   * We don't test for buffer sizes, so make sure that userspace allocated
   * buffers through this driver.
   */

  if (bfcontainer)
    {
      memcpy(bfcontainer->apb->samp,
             &priv->dma_buffer[(priv->ct * SAI_BUFFER_ADJUSTED_SIZE)],
             SAI_BUFFER_ADJUSTED_SIZE);

      /* Perform the transfer done callback */

      DEBUGASSERT(bfcontainer->callback);
      bfcontainer->callback(&priv->dev, bfcontainer->apb,
                            bfcontainer->arg, priv->transfer_result);

      sai_container_free(priv, bfcontainer);
    }
  else
    {
      i2swarn("No RX buffer available");
    }

  /* Change current target of double buffer */

  priv->ct ^= 1;
}

/****************************************************************************
 * Name: sai_fill_buffer_tx
 *
 * Description:
 *   Copy data from the user space audio buffer to the DMA buffer and return
 *   the audio buffer to user space immediately, for reuse.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void sai_fill_buffer_tx(struct stm32h7_sai_s *priv)
{
  struct sai_buffer_s *bfcontainer;

  nxmutex_lock(&priv->queue_lock);
  bfcontainer = (struct sai_buffer_s *)sq_remfirst(&priv->pend);
  nxmutex_unlock(&priv->queue_lock);

  /* If we don't have a buffer from userspace then we just send 0 values.
   * We don't test for buffer sizes, so make sure that userspace allocated
   * buffers through this driver.
   */

  if (bfcontainer)
    {
      memcpy(&priv->dma_buffer[(priv->ct * SAI_BUFFER_ADJUSTED_SIZE)],
             bfcontainer->apb->samp, SAI_BUFFER_ADJUSTED_SIZE);

      /* Return buffer to userspace immediately. Transfer result is actually
       * the result of the previous transfer, since we're not waiting for the
       * transfer to complete before returning the buffer.
       */

      DEBUGASSERT(bfcontainer->callback);
      bfcontainer->callback(&priv->dev, bfcontainer->apb,
                            bfcontainer->arg, priv->transfer_result);

      sai_container_free(priv, bfcontainer);
    }
  else
    {
      i2swarn("No TX buffer available. Sending value 0.");
      memset(&priv->dma_buffer[(priv->ct * SAI_BUFFER_ADJUSTED_SIZE)], 0,
             SAI_BUFFER_ADJUSTED_SIZE);
    }

  /* Change current target of double buffer */

  priv->ct ^= 1;
}

/****************************************************************************
 * Name: sai_fill_buffer
 *
 * Description:
 *   Forward buffer call to appropriate function depending on transfer
 *   direction.
 *
 * Input Parameters:
 *   priv - SAI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

