Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
static inline void sai_fill_buffer(struct stm32h7_sai_s *priv)
{
  if (priv->tx)
    {
      sai_fill_buffer_tx(priv);
    }
  else
    {
      sai_fill_buffer_rx(priv);
    }
}


/****************************************************************************
 * Name: sai_dma_channel_configure
 *
 * Description:
 *   Configure the (B)DMA for a single SAI block's transfer size and direction.
 *
 * Input Parameters:
 *   priv - SAI state instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_dma_channel_configure(struct stm32h7_sai_s *priv)
{
  stm32_dmacfg_t dmacfg;
  apb_samp_t nbytes = SAI_BUFFER_ADJUSTED_SIZE;
  uint32_t ntransfers = 0;
  uint32_t dma_ccr = SAI_DMA_BASE_CR;

  if (priv->tx)
    {
      dma_ccr |= SAI_DMA_TX_CR;
    }
  else
    {
      dma_ccr |= SAI_DMA_RX_CR;
    }

  switch (priv->format->datasize)
    {
      case 8:
        dma_ccr |= SAI_DMA_8BIT_CR;
        ntransfers = nbytes;
        break;

      default:
      case 16:
        dma_ccr |= SAI_DMA_16BIT_CR;
        DEBUGASSERT((nbytes & 0x1) == 0);
        ntransfers = nbytes >> 1;
        break;

      case 32:
        dma_ccr |= SAI_DMA_32BIT_CR;
        DEBUGASSERT((nbytes & 0x3) == 0);
        ntransfers = nbytes >> 2;
        break;
    }

  DEBUGASSERT(ntransfers > 0);

  /* Always start with the first of the double buffers as current target */

  priv->ct = 0;

  dmacfg.paddr = priv->base + STM32H7_SAI_DR_OFFSET;
  dmacfg.maddr = (uintptr_t)priv->dma_buffer;
  dmacfg.ndata = ntransfers;
  dmacfg.cfg1  = dma_ccr;
  dmacfg.cfg2  = 0;

  stm32_dmasetup(priv->dma, &dmacfg);

  /* Enable DMA. Transfer won't start until SAI has been enabled as well. */

  stm32_dmastart(priv->dma, sai_dma_callback, priv, false);
}

/****************************************************************************
 * Name: sai_stop
 *
 * Description:
 *   Disable both SAI blocks. If transfers are ongoing this function will block
 *   until they are finished.
 *
 * Input Parameters:
 *   priv - SAI state instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int sai_stop(struct stm32h7_sai_s *priv)
{
  priv->started = 0;

  sai_disable(priv);
  sai_disable_dma(priv);

  if (priv->reserved == 0 && priv->sync_priv->reserved == 0)
    {
      /* Reserved means that a higher layer is using the driver. If no one is
       * using it we should power off.
       */

      i2swarn("driver not reserved");
      sai_clear_all_queues(priv);
      sai_pwr_disable(priv->sai_block);
    }

  return OK;
}

/****************************************************************************
 * Name: sai_start
 *
 * Description:
 *   Enable both SAI blocks, thus starting transfers.
 *   Note that it is possible for user space to queue audio buffers before
 *   calling this function.
 *
 * Input Parameters:
 *   priv - SAI state instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline int sai_start(struct stm32h7_sai_s *priv)
{
  struct stm32h7_sai_s *priv_tx;

  if (priv->reserved == 0 && priv->sync_priv->reserved == 0)
    {
      /* Reserved means that a higher layer is using the driver. If no one is
       * using it we should power off.
       */

      i2swarn("driver not reserved");
      sai_clear_all_queues(priv);
      sai_pwr_disable(priv->sai_block);
      return -EACCES;
    }

  if (priv->started)
    {
      i2sinfo("transmission already active");
      return OK;
    }

  priv->started = 1;

  sai_disable(priv);
  sai_disable_dma(priv);

  sai_dma_channel_configure(priv);
  sai_dma_channel_configure(priv->sync_priv);

  /* User may have prepared audio output by placing buffers in queue. Otherwise
   * we need to zero the DMA buffer anyways, so call the function to fill the
   * TX buffer twice in order to fill both DMA buffers in our double buffer
   * setup.
   */

  priv_tx = (priv->tx) ? priv : priv->sync_priv;
  sai_fill_buffer(priv_tx);
  sai_fill_buffer(priv_tx);

  sai_enable_dma(priv);
  sai_enable(priv);

  i2sinfo("Done");

  return OK;
}

/****************************************************************************
 * Name: sai_worker
 *
 * Description:
 *   Transfer worker, scheduled from DMA callback (interrupt context).
 *
 * Input Parameters:
 *   arg - the SAI device instance cast to void*
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_worker(void *arg)
{
  struct stm32h7_sai_s *priv = (struct stm32h7_sai_s *)arg;

  DEBUGASSERT(priv);

  sai_fill_buffer(priv);
}

/****************************************************************************
 * Name: sai_dma_callback
 *
 * Description:
 *   This callback function is invoked at the completion of the SAI DMA.
 *
 * Input Parameters:
 *   handle - The DMA handler
 *   isr    - The interrupt status of the DMA transfer
 *   arg    - A pointer to the SAI state instance
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_dma_callback(DMA_HANDLE handle, uint8_t isr, void *arg)
{
  struct stm32h7_sai_s *priv = (struct stm32h7_sai_s *)arg;
  int ret = ERROR;

  DEBUGASSERT(priv);

  priv->transfer_result = (isr & DMA_STATUS_TEIF) ? -EIO : OK;

  /* Schedule the done processing to occur on the worker thread. */

  if (work_available(&priv->work))
    {
      ret = work_queue(HPWORK, &priv->work, sai_worker, priv, 0);
    }
  if (ret != OK)
    {
      i2serr("ERROR: Failed to queue work: %d\n", ret);
    }
}

/****************************************************************************
 * Name: sai_queue_transfer
 *
 * Description:
 *   Queue an audio buffer for transfer.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   apb      - A pointer to the user space audio buffer
 *   callback - A user provided callback function that will be called at
 *              the completion of the transfer.  The callback will be
 *              performed in the context of the worker thread.
 *   arg      - An opaque argument that will be provided to the callback
 *              when the transfer complete
 *   timeout  - The timeout value to use. We ignore this since we are running
 *              continously in circular double buffer mode.
 *   tx       - Transfer direction. True: TX, false: RX
 *
 * Returned Value:
 *   OK.
 *
 *   NOTE: This function only enqueues the transfer and returns
 *   immediately. Success here only means that the transfer was enqueued
 *   correctly.
 *   When the transfer is complete, a 'result' value will be provided as
 *   an argument to the callback function that will indicate if the transfer
 *   failed.
 *
 ****************************************************************************/

static int sai_queue_transfer(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                              i2s_callback_t callback, void *arg,
                              uint32_t timeout, uint8_t tx)
{
  struct stm32h7_sai_s *priv = (struct stm32h7_sai_s *)dev;
  struct sai_buffer_s *bfcontainer;

  UNUSED(timeout);

