Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
  DEBUGASSERT(priv && apb);

  /* In sync mode only the Master should receive commands. */

  DEBUGASSERT(priv->master);

  if (priv->tx != tx)
    {
      /* The Slave might be responsible for the transfer direction. */

      priv = (struct stm32h7_sai_s *)priv->sync_priv;
      DEBUGASSERT(priv);
    }

  bfcontainer = sai_container_allocate(priv);
  DEBUGASSERT(bfcontainer);

  /* Add the buffer to a container and add the container to the end of the
   * pending queue
   */

  nxmutex_lock(&priv->lock);

  bfcontainer->callback = (void *)callback;
  bfcontainer->arg      = arg;
  bfcontainer->apb      = apb;
  bfcontainer->result   = -EBUSY;

  nxmutex_lock(&priv->queue_lock);
  sq_addlast((sq_entry_t *)bfcontainer, &priv->pend);
  nxmutex_unlock(&priv->queue_lock);

  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: sai_receive
 *
 * Description:
 *   Queue a buffer for receiving audio data.
 *
 * Input Parameters:
 *   See sai_queue_transfer()
 *
 * Returned Value:
 *   See sai_queue_transfer()
 *
 ****************************************************************************/

static int sai_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                       i2s_callback_t callback, void *arg, uint32_t timeout)
{
  i2sinfo("Entry");
  return sai_queue_transfer(dev, apb, callback, arg, timeout, 0);
}

/****************************************************************************
 * Name: sai_send
 *
 * Description:
 *   Queue a buffer for sending audio data.
 *
 * Input Parameters:
 *   See sai_queue_transfer()
 *
 * Returned Value:
 *   See sai_queue_transfer()
 *
 ****************************************************************************/

static int sai_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                    i2s_callback_t callback, void *arg, uint32_t timeout)
{
  i2sinfo("Entry");
  return sai_queue_transfer(dev, apb, callback, arg, timeout, 1);
}

/****************************************************************************
 * Name: sai_ioctl
 *
 * Description:
 *   IOCTL commands.
 *   These commands are not intended for user space control but for
 *   interaction with an audio driver.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   cmd      - Command values AUDIOIOC_* from audio.h are used
 *   arg      - Pointer to data needed by command, cast to unsigned long
 *
 * Returned Value:
 *   OK on success or negative error value
 *
 ****************************************************************************/

static int sai_ioctl(struct i2s_dev_s *dev, int cmd, unsigned long arg)
{
  struct stm32h7_sai_s *priv = (struct stm32h7_sai_s *)dev;
  struct audio_buf_desc_s *bufdesc;
  struct ap_buffer_s *apb;
  int ret = -ENOTTY;

  switch (cmd)
    {
    case AUDIOIOC_RESERVE:
      {
        i2sinfo("AUDIOIOC_RESERVE");

        ret = OK;
        nxmutex_lock(&priv->lock);
        if (priv->reserved >= SAI_MAX_RESERVE)
          {
            i2serr("Already reserved");
            ret = -EBUSY;
          }
        else
          {
            if (!priv->reserved)
              {
                sai_pwr_enable(priv->sai_block);
              }
            priv->reserved += 1;
          }
        nxmutex_unlock(&priv->lock);
      }
      break;
    case AUDIOIOC_RELEASE:
      {
        i2sinfo("AUDIOIOC_RELEASE");

        ret = OK;
        nxmutex_lock(&priv->lock);
        priv->reserved -= 1;
        DEBUGASSERT(priv->reserved >= 0);
        if (priv->reserved == 0 && priv->started)
          {
            ret = sai_stop(priv);
          }
        nxmutex_unlock(&priv->lock);
      }
      break;
    case AUDIOIOC_START:
      {
        i2sinfo("AUDIOIOC_START");

        nxmutex_lock(&priv->lock);
        ret = sai_start(priv);
        nxmutex_unlock(&priv->lock);
      }
      break;
    case AUDIOIOC_STOP:
      {
        i2sinfo("AUDIOIOC_STOP");

        nxmutex_lock(&priv->lock);
        ret = sai_stop(priv);
        nxmutex_unlock(&priv->lock);
      }
      break;
    case AUDIOIOC_ALLOCBUFFER:
      {
        i2sinfo("AUDIOIOC_ALLOCBUFFER");

        nxmutex_lock(&priv->lock);
        apb = (struct ap_buffer_s *)sq_remfirst(&priv->apb_freelist);
        if (apb != NULL)
          {
            bufdesc = (struct audio_buf_desc_s *)arg;
            bufdesc->u.buffer = apb;
            i2sinfo("samp addr: 0x%x", (unsigned int)bufdesc->u.buffer->samp);

            /* Ignore request values for buffer size. We created the buffers
             * at compilation time.
             */

            apb->nmaxbytes  = SAI_BUFFER_ADJUSTED_SIZE;
            apb->crefs      = 1;
            apb->nbytes     = 0;
            apb->flags      = 0;
      #ifdef CONFIG_AUDIO_MULTI_SESSION
            apb->session    = bufdesc->session;
      #endif
            ret = sizeof(struct audio_buf_desc_s);
          }
        else
          {
            i2serr("No buffer mem available");
            ret = -ENOMEM;
          }
        nxmutex_unlock(&priv->lock);
      }
      break;
    case AUDIOIOC_FREEBUFFER:
      {
        i2sinfo("AUDIOIOC_FREEBUFFER");

        nxmutex_lock(&priv->lock);
        bufdesc = (struct audio_buf_desc_s *)arg;
        DEBUGASSERT(bufdesc->u.buffer != NULL);
        sq_addfirst((sq_entry_t *)bufdesc->u.buffer, &priv->apb_freelist);
        ret = sizeof(struct audio_buf_desc_s);
        nxmutex_unlock(&priv->lock);
      }
      break;

    default:
      break;
  }

return ret;
}

/****************************************************************************
 * Name: sai_interrupt
 *
 * Description:
 *   Prints status register on error interrupt
 *
 * Input Parameters:
 *   irq     -
 *   context -
 *   arg     - the SAI device instance cast to void*
 *
 * Returned Value:
 *   OK
 *
 ****************************************************************************/

static int sai_interrupt(int irq, void *context, void *arg)
{
  struct stm32h7_sai_s *priv = (struct stm32h7_sai_s *)arg;
  uint32_t sr = sai_getreg(priv, STM32H7_SAI_SR_OFFSET);

  i2serr("Status: 0x%08x\n", sr);

  return OK;
}

/****************************************************************************
 * Name: sai_container_allocate
 *
 * Description:
 *   Allocate a buffer container by removing the one at the head of the
 *   free list
 *
 * Input Parameters:
 *   priv - SAI state instance
 *
 * Returned Value:
 *   A non-NULL pointer to the allocate buffer container on success; NULL if
 *   there are no available buffer containers.
 *
 * Assumptions:
 *   The caller does NOT have exclusive access to the SAI state structure.
 *   That would result in a deadlock!
 *
 ****************************************************************************/

