Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
static struct sai_buffer_s *sai_container_allocate(struct stm32h7_sai_s *priv)
{
  struct sai_buffer_s *bfcontainer;
  irqstate_t flags;

  /* Set aside a buffer container.  By doing this, we guarantee that we will
   * have at least one free buffer container.
   */

  nxsem_wait_uninterruptible(&priv->bufsem);

  /* Get the buffer from the head of the free list */

  flags = enter_critical_section();
  bfcontainer = priv->freelist;
  DEBUGASSERT(bfcontainer);

  /* Unlink the buffer from the freelist */

  priv->freelist = bfcontainer->flink;
  leave_critical_section(flags);

  return bfcontainer;
}

/****************************************************************************
 * Name: sai_container_free
 *
 * Description:
 *   Free buffer container by adding it to the head of the free list
 *
 * Input Parameters:
 *   priv - SAI state instance
 *   bfcontainer - The buffer container to be freed
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The caller has exclusive access to the SAI state structure
 *
 ****************************************************************************/

static void sai_container_free(struct stm32h7_sai_s *priv,
                               struct sai_buffer_s *bfcontainer)
{
  irqstate_t flags;

  /* Put the buffer container back on the free list */

  flags = enter_critical_section();
  bfcontainer->flink  = priv->freelist;
  priv->freelist = bfcontainer;
  leave_critical_section(flags);

  /* Wake up any threads waiting for a buffer container */

  nxsem_post(&priv->bufsem);
}

/****************************************************************************
 * Name: sai_buf_initialize
 *
 * Description:
 *   Initialize the buffer container allocator by adding all of the
 *   pre-allocated buffer containers to the free list
 *
 * Input Parameters:
 *   priv - SAI state instance
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called early in SAI initialization so that there are no issues with
 *   concurrency.
 *
 ****************************************************************************/

static void sai_buf_initialize(struct stm32h7_sai_s *priv)
{
  int i;
  struct stm32h7_sai_s *priv_master = (priv->master) ? priv : priv->sync_priv;

  /* Place buffer containers used locally in freelist */

  priv->freelist = NULL;
  for (i = 0; i < SAI_NUMBER_OF_CONTAINERS; i++)
    {
      sai_container_free(priv, &priv->containers[i]);
    }


  /* Assign sample buffers to apb buffers. Place apb buffers in master's
   * freelist. apb buffers are passed to userspace through IOCTL allocation
   * calls from audio driver.
   */

  for (i = 0; i < SAI_NUMBER_OF_BUFFERS; i++)
    {
      priv->apb_buffers[i].samp =
                              &priv->apb_samps[(i*SAI_BUFFER_ADJUSTED_SIZE)];
      nxmutex_init(&priv->apb_buffers[i].lock);
      sq_addfirst((sq_entry_t *)&priv->apb_buffers[i],
                  &priv_master->apb_freelist);
    }
}

/****************************************************************************
 * Name: sai_configure
 *
 * Description:
 *   Configure the selected SAI block
 *
 * Input Parameters:
 *   priv   - SAI state instance
 *   format - Pointer to static struct that describes the audio format
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sai_configure(struct stm32h7_sai_s *priv,
                          struct sai_format_s *format)
{
  uint32_t regcr1;
  uint32_t regfrcr;
  uint32_t regslot;
  uint32_t regim;
  uint32_t framelen;
  uint32_t frameactive;

  DEBUGASSERT(priv && format);

  sai_disable(priv);

  regcr1 = sai_getreg(priv, STM32H7_SAI_CR1_OFFSET);

  DEBUGASSERT(format->nslots <= 16);

  regfrcr = sai_getreg(priv, STM32H7_SAI_FRCR_OFFSET);
  regslot = sai_getreg(priv, STM32H7_SAI_SLOTR_OFFSET);

  if (format->nslots != 0 && format->nslots <= 16)
    {
      /* TDM */

      DEBUGASSERT(format->leftslot <= format->nslots);
      DEBUGASSERT(format->leftslot > 0);
      DEBUGASSERT(format->rightslot <= format->nslots);

      /* Frame register */

      framelen = format->nslots * format->slotsize;
      if (format->nodiv == 0)
        {
          /* If nodiv is 0, then frame length must be a power of 2. */

          uint32_t fl = 8;
          while (framelen > fl)
            {
              fl = fl << 1;
            }
          framelen = fl;
        }
      DEBUGASSERT(framelen >= 8 && framelen <= 256);

      frameactive = 1;

      regfrcr &= ~SAI_FRCR_FSDEF;
      regfrcr |= SAI_FRCR_FSPOL;
      regfrcr |= SAI_FRCR_FSOFF;

      /* Slot register */

      regslot &= ~SAI_SLOTR_SLOTSZ_MASK;
      switch (format->slotsize)
        {
          case 16:
            regslot |= SAI_SLOTR_SLOTSZ_16BIT;
            break;

          case 32:
            regslot |= SAI_SLOTR_SLOTSZ_32BIT;
            break;

          default:
            regslot |= SAI_SLOTR_SLOTSZ_DATA;
            break;
        }

      regslot &= ~SAI_SLOTR_NBSLOT_MASK;
      regslot |= SAI_SLOTR_NBSLOT(format->nslots);

      regslot &= ~SAI_SLOTR_SLOTEN_MASK;
      regslot |= SAI_SLOTR_SLOTEN(format->leftslot);
      if (format->rightslot > 0)
        {
          regslot |= SAI_SLOTR_SLOTEN(format->rightslot);
        }
    }
  else
    {
      /* I2S */

      /* Frame register */

      framelen = format->datasize * 2;
      frameactive = format->datasize;

      regfrcr |= SAI_FRCR_FSDEF_CHID;
      regfrcr &= ~SAI_FRCR_FSPOL;
      regfrcr |= SAI_FRCR_FSOFF_BFB;

      /* Slot register */

      regslot &= ~SAI_SLOTR_SLOTSZ_MASK;
      regslot |= SAI_SLOTR_SLOTSZ_DATA;

      regslot &= ~SAI_SLOTR_NBSLOT_MASK;
      regslot |= SAI_SLOTR_NBSLOT(2);

      regslot &= ~SAI_SLOTR_SLOTEN_MASK;
      regslot |= SAI_SLOTR_SLOTEN_0;
      regslot |= SAI_SLOTR_SLOTEN_1;
    }

  regfrcr &= ~SAI_FRCR_FRL_MASK;
  regfrcr |= SAI_FRCR_FRL(framelen);

  regfrcr &= ~SAI_FRCR_FSALL_MASK;
  regfrcr |= SAI_FRCR_FSALL(frameactive);

  sai_putreg(priv, STM32H7_SAI_FRCR_OFFSET, regfrcr);
  sai_putreg(priv, STM32H7_SAI_SLOTR_OFFSET, regslot);

  /* Configuration 1 register */

  i2sinfo("master: %d, mode: %s", priv->master, (priv->tx) ? "TX" : "RX");

  regcr1 &= ~SAI_CR1_MODE_MASK;
  if (priv->master)
    {
      if (priv->tx)
        {
          regcr1 |= SAI_CR1_MODE_MASTER_TX;
        }
      else
        {
          regcr1 |= SAI_CR1_MODE_MASTER_RX;
        }
    }
  else
    {
      if (priv->tx)
        {
          regcr1 |= SAI_CR1_MODE_SLAVE_TX;
        }
      else
        {
          regcr1 |= SAI_CR1_MODE_SLAVE_RX;
        }
    }

  regcr1 &= ~SAI_CR1_PRTCFG_MASK;             /* Free protocol */

  regcr1 &= ~SAI_CR1_DS_MASK;
  switch (format->datasize)
    {
      case 8:
        regcr1 |= SAI_CR1_DS_8BITS;
        break;

      default:
      case 16:
        regcr1 |= SAI_CR1_DS_16BITS;
        break;

      case 32:
        regcr1 |= SAI_CR1_DS_32BITS;
        break;
    }

  regcr1 &= ~SAI_CR1_LSBFIRST;
  regcr1 &= ~SAI_CR1_CKSTR;

