Lars-Thrane-as/nuttx/arch/arm/src/stm32h7/stm32_sai_duplex.c
  regcr1 &= ~SAI_CR1_SYNCEN_MASK;
  if (!priv->master)
    {
      regcr1 |= SAI_CR1_SYNCEN_INTERNAL;      /* Synchronous Slave */
    }

  regcr1 &= ~SAI_CR1_MONO;
  regcr1 |= SAI_CR1_OUTDRIV;

  regcr1 &= ~SAI_CR1_DMAEN;

  /* Clock */

  if (format->nodiv)
    {
      regcr1 |= SAI_CR1_NODIV;
    }
  else
    {
      regcr1 &= ~SAI_CR1_NODIV;
    }

  regcr1 &= ~SAI_CR1_MCKDIV_MASK;
  regcr1 |= SAI_CR1_MCKDIV(format->mckdiv);

  if (format->osr)
    {
      regcr1 |= SAI_CR1_OSR;
    }
  else
    {
      regcr1 &= ~SAI_CR1_OSR;
    }

  if (format->mcken)
    {
      regcr1 |= SAI_CR1_MCKEN;
    }
  else
    {
      regcr1 &= ~SAI_CR1_MCKEN;
    }

  sai_putreg(priv, STM32H7_SAI_CR1_OFFSET, regcr1);

  /* Configuration 2 register */

  if (priv->tx)
    {
      sai_modifyreg(priv, STM32H7_SAI_CR2_OFFSET, SAI_CR2_FTH_MASK,
                    SAI_CR2_FTH_1QF);
    }
  else
    {
      sai_modifyreg(priv, STM32H7_SAI_CR2_OFFSET, SAI_CR2_FTH_MASK,
                    SAI_CR2_FTH_1QF);
    }

  /* Interrupt mask register */

  regim = SAI_INT_OVRUDR;
  if (priv->master)
    {
      regim |= SAI_INT_WCKCFG;
    }
  else
    {
      regim |= SAI_INT_AFSDET | SAI_INT_LFSDET;
    }
  sai_putreg(priv, STM32H7_SAI_IM_OFFSET, regim);
}

/****************************************************************************
 * Name: sai_init
 *
 * Description:
 *   Initialize the selected SAI block
 *
 * Input Parameters:
 *   intf   - SAI block id
 *   format - Pointer to static struct that describes the audio format
 *   tx     - Transfer direction
 *
 * Returned Value:
 *   SAI instance private state
 *
 ****************************************************************************/

static struct stm32h7_sai_s *sai_init(int intf, struct sai_format_s *format,
                                      uint8_t tx)
{
  struct stm32h7_sai_s *priv = NULL;

  switch (intf)
    {
#ifdef CONFIG_STM32H7_SAI1_A
      case SAI1_BLOCK_A:
        {
          i2sinfo("SAI1 Block A Selected\n");
          priv = &g_sai1a_priv;

          stm32_configgpio(GPIO_SAI1_SD_A);
#  ifndef CONFIG_STM32H7_SAI1_A_SYNC_WITH_B
          stm32_configgpio(GPIO_SAI1_FS_A);
          stm32_configgpio(GPIO_SAI1_SCK_A);
          stm32_configgpio(GPIO_SAI1_MCLK_A);
#  endif
          break;
        }
#endif

#ifdef CONFIG_STM32H7_SAI1_B
      case SAI1_BLOCK_B:
        {
          i2sinfo("SAI1 Block B Selected\n");
          priv = &g_sai1b_priv;

          stm32_configgpio(GPIO_SAI1_SD_B);
#  ifndef CONFIG_STM32H7_SAI1_B_SYNC_WITH_A
          stm32_configgpio(GPIO_SAI1_FS_B);
          stm32_configgpio(GPIO_SAI1_SCK_B);
          stm32_configgpio(GPIO_SAI1_MCLK_B);
#  endif
          break;
        }
#endif

#ifdef CONFIG_STM32H7_SAI4_A
      case SAI4_BLOCK_A:
        {
          i2sinfo("SAI4 Block A Selected\n");
          priv = &g_sai4a_priv;

          stm32_configgpio(GPIO_SAI4_SD_A);
#  ifndef CONFIG_STM32H7_SAI4_A_SYNC_WITH_B
          stm32_configgpio(GPIO_SAI4_FS_A);
          stm32_configgpio(GPIO_SAI4_SCK_A);
          stm32_configgpio(GPIO_SAI4_MCLK_A);
#  endif
          break;
        }
#endif

#ifdef CONFIG_STM32H7_SAI4_B
      case SAI4_BLOCK_B:
        {
          i2sinfo("SAI4 Block B Selected\n");
          priv = &g_sai4b_priv;

          stm32_configgpio(GPIO_SAI4_SD_B);
#  ifndef CONFIG_STM32H7_SAI4_B_SYNC_WITH_A
          stm32_configgpio(GPIO_SAI4_FS_B);
          stm32_configgpio(GPIO_SAI4_SCK_B);
          stm32_configgpio(GPIO_SAI4_MCLK_B);
#  endif
          break;
        }
#endif

      default:
        {
          i2serr("Could not find SAI interface %d\n", intf);
          goto err;
        }
    }

  priv->format = format;
  priv->tx = tx;

  sai_buf_initialize(priv);

  priv->dma = stm32_dmachannel(priv->dma_ch);
  DEBUGASSERT(priv->dma);

  sai_configure(priv, format);

  sai_dump_regs(priv, "After initialization");

err:
  return priv;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_sai_duplex_initialize
 *
 * Description:
 *   Initialize both SAI blocks in a synchronous setup.
 *   RX and TX interfaces must belong to the same SAI (SAI1 or SAI4).
 *
 * Input Parameters:
 *   block_rx - SAI block id for RX interface
 *   block_tx - SAI block id for TX interface
 *   format   - Pointer to static struct that describes the audio format
 *
 * Returned Value:
 *   Valid Master I2S device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct i2s_dev_s *stm32_sai_duplex_initialize(int block_rx, int block_tx,
                                              struct sai_format_s *format)
{
  struct stm32h7_sai_s *priv_rx;
  struct stm32h7_sai_s *priv_tx;
  irqstate_t flags;

  flags = enter_critical_section();
  sai_pwr_enable(block_tx);

  priv_rx = sai_init(block_rx, format, 0);
  priv_tx = sai_init(block_tx, format, 1);
  DEBUGASSERT(priv_rx && priv_tx && (priv_rx->master != priv_tx->master));

  sai_pwr_disable(block_tx);

  /* Attach the IRQ to the driver */

  if (irq_attach(priv_tx->irq, sai_interrupt, priv_tx))
    {
      i2serr("ERROR: Can't initialize sai irq\n");
    }
  else
    {
      up_enable_irq(priv_tx->irq);
    }

  leave_critical_section(flags);

  return (priv_rx->master) ? &priv_rx->dev : &priv_tx->dev;
}

#endif /* CONFIG_STM32H7_SAI_DRIVER_DUPLEX */
